AcDbLoftProfile.op_Assign(AcDb3dProfile!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assignment operator.  Copies the entity and edge data from the
input object, but does not change the continuity or magnitude.
src:
Source object to be copied.
Returns:
Reference to this object.

AcDbLoftProfile.op_Assign(AcDbLoftProfile!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assignment operator.
src:
Source object to be copied.
Returns:
Reference to this object.

AcDbLoftProfile.setMagnitude(System.Double)
Set the magnitude of the takeoff vector for the profile if
the continuity is 1 or 2.
value:
Magnitude of takeoff vector.

AcDbLoftProfile.magnitude
Return the magnitude of the takeoff vector if the continuity is
1 or 2.  By default, this value is 0.5 unless it has been
explicitly set to another value.
Returns:
Magnitude of the takeoff vector.

AcDbLoftProfile.setContinuity(System.Int16)
Set the continuity for the profile.
value:
Must be 0, 1, or 2, which corresponds to a continuity of
G0, G1, or G2.

AcDbLoftProfile.continuity
Return the continuity for the profile: 0, 1, or 2, which
corresponds to a continuity of G0, G1, or G2.  By default, the
continuity is 1 unless it has been explicitly set to another
value.
Returns:
Continuity for the profile: 0, 1, or 2, which
corresponds to a continuity of G0, G1, or G2.

AcDbLoftProfile.copyFrom(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Copies the contents of input object into this object.
src:
Source object to be copied.
Returns:
eOk if successful.

AcDbLoftProfile.#ctor(AcDbLoftProfile!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor.
src:
Source object to be copied.

AcDbLoftProfile.#ctor(AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for a profile that is a point.
pnt:
An AcGePoint3d that is to be used as a profile to create
a surface such as an extrusion or loft.

AcDbLoftProfile.#ctor(AcDbPathRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for a profile that is an edge or a sequence of connected
edges.
pathRef:
Subent paths of the edges that make up the profile.

AcDbLoftProfile.#ctor(AcDbEntity*)
Constructor for a profile that is an entity such as a curve or region.
pEntity:
Pointer to an AcDbEntity that is to be used as a profile to create
a surface such as an extrusion or loft.

AcDbLoftProfile.#ctor
Default constructor.

AcDbLoftProfile
This class is used to represent a profile that can be used as input to
createLoftedSurface().  An object of this class can represent an entity
such as a curve or a region, or it can represent an edge or a set of edges
that form a connected chain.  This class also maintains continuity data
if the profile is for an edge or point and the profile is the first or
last profile of the loft.